/* $Id: Localizable.strings,v 1.6 2004/06/23 08:12:20 bart Exp $ */

"Yes" = "はい";
"No" = "いいえ";
"Ok" = "OK";

"Download" = "ダウンロード";
"Cancel" = "キャンセル";
"Changes" = "変更点";

"LockAppleKeychain" = "キーチェーンをロック";
"UnlockAppleKeychain" = "キーチェーンをロック解除";

"AddedAuthsockToEnvironment" = "変数 SSH_AUTH_SOCK を ~/.MacOSX/environment.plist に追加しました。\n次回ログインした時に有効になります。";
"ChangedAuthsockInEnvironment" = "~/.MacOSX/environment.plist 中の変数 SSH_AUTH_SOCK を変更しました。\n次回ログインした時に有効になります。";

"CheckForUpdates" = "アップデートを確認";
"FailedToRetrieveXMLVersionInfo" = "XML バージョン情報を検索するのに失敗しました。";

"Can'tFigureOutOwnVersion" = "自分自身のバージョンが分かりません。";

"NewVersion" = "新バージョン";
"NewVersionAvailable" = "新しいバージョンの SSHKeychain があります。";
"NoNewVersion" = "新しいバージョンはありません。";

"AgentTerminatedPanelTitle" = "エージェントの終了";
"AgentTerminatedPanelText" = "エージェントが予期せず終了しました。再起動させますか？";

"PreferencesNotSavedPanelTitle" = "環境設定の未保存";
"PreferencesNotSavedPanelText" = "環境設定を保存してよろしいですか？";

"DisplayPanelTitle" = "表示";
"DisplayPanelText" = "表示の変更は次回このプログラムが起動された時に有効になります。";
"DisplayChangeNotAllowed" = "SSHKeychain バンドルに書き込み許可がありませんので、表示オプションは変更できません。";

"NewSocketpathPanelTitle" = "新しいソケットのパス";
"NewSocketpathPanelText" = "新しいソケットのパスはエージェントが次回起動した時に使用されます。\nグローバル環境変数 SSH_AUTH_SOCK は次回のログインで有効になります。";

"InvalidKey" = "不正なキー";
"KeyAlreadyOnList" = "キーはすでにリスト中に存在します";

"ReadPermissionToKeyDenied" = "キーに読み取り属性がありません";

"InvalidPrivateKey" = "不正なプライベートキーです";

"StartAgent" = "エージェントを開始";
"StopAgent" = "エージェントを停止";

"FailedToStartAgent" = "ssh-agent の開始に失敗しました。";
"FailedToStopAgent" = "ssh-agent の停止に失敗しました。";
"FailedToStartAgentSocketpathInvalid" = "ssh-agent の開始に失敗しました。ソケットのパスが不正です。";
"AgentNotFound" = "指定されたツールのパス中に ssh-agent が見つかりませんでした。";

"AddAllKeysToAgent" = "すべてのキーを追加";
"AddAllKeysToAgentFailed" = "すべてのキーをエージェントに追加するのに失敗しました。";
"AddSingleKeyToAgent" = "一つのキーを追加";
"AddSingleKeyToAgentFailed" = "キーをエージェントに追加するのに失敗しました。";
"AgentNotRunning" = "エージェントは実行されていません。";

"RemoveAllKeysFromAgent" = "すべてのキーを取り除く";
"RemoveAllKeysFromAgentFailed" = "エージェントからすべてのキーを取り除くことに失敗しました。";

"AgentNotStarted" = "エージェントは開始されていません";
"InternalInconsistency" = "内部不整合";

"SocketpathDirectory" = "ソケットのパスはディレクトリに思われます。";
"PleaseChangeSocketpath" = "環境設定でソケットのパスを変更してください。";

"Can'tWriteSocketInDirectory" = "ディレクトリにソケットを書き込むことができません。";
"PleaseCheckPermissions" = "アクセス権を確認してください。";

"Couldn'tCreateSocketDirectory" = "ソケットが属するべきディレクトリを作成することができません。";
"PleaseCreateItManually" = "手動で作成してください。";


"PleaseSelectAPath" = "パスを選択してください。";
"AlreadyExists" = "すでに存在します。";
"KeyTypeUnknown" = "キーの種類が不明です。";
"NumberOfBitsInvalid" = "ビット数が不正です。";
"PassphraseTooShort" = "パスフレーズが短すぎます(最低 5 文字)。";
"Generating" = "生成中...";
"KeyGenerationFailed" = "キーの生成に失敗しました。";

"WhereWouldYouLikeToSaveThePrivateKey" = "プライベートキーをどこへ保存しますか？";

"Enter passphrase for " = "パスフレーズを入力してください ";

"AddPassphraseToAppleKeychain" = "パスフレーズをキーチェーンに登録";
"Passphrase" = "パスフレーズ";

"TunnelForwardingFailed" = "トンネル転送失敗";

"ForwardingFailedDuringInitialization" = "初期化中に転送が失敗しました。";

"TunnelSetupFailed" = "トンネルの構築失敗";

"TunnelTerminated" = "トンネルの終了";
"TunnelUnexpectedlyTerminated" = "トンネルは再三予期せず終了しました。再起動されませんでした。";
"TunnelTerminatedAndCouldNotBeRestarted" = "トンネルは予期せず終了し、再起動できませんでした。";

"ActiveTunnel" = "個の有効なトンネル";
"ActiveTunnels" = "個の有効なトンネル";
"NoActiveTunnels" = "有効なトンネルがありません";

"ConfirmationPanelTitle" = "確認が必要とされました";
"ConfirmationPanelText" = "クライアントがキーを使用しようとしました。許可してもよろしいですか？";

"Preferences" = "環境設定";
"General" = "一般";
"Display" = "表示";
"Tunnels" = "トンネル";
"Security" = "セキュリティ";
"Environment" = "環境変数";
"SSH Keys" = "SSH キー";
